# 6. Select Data

In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='Sib. #')
df

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

## Select Column (label)

In [4]:
df['name']

Sib. #
1st     Sally
2nd     David
3rd    Daniel
4th     Peter
Name: name, dtype: object

In [5]:
df[['name', 'height']]

          name  height
Sib. #
1st      Sally     157
2nd      David     173
3rd     Daniel     175
4th      Peter     130

## Select Column (integer index)

In [8]:
df.columns

Index(['name', 'school', 'height', 'English', 'Math', 'Science', 'SWskills'], dtype='object')

In [9]:
df.columns[0]

'name'

In [10]:
df.columns[2]

'height'

In [11]:
df[df.columns[0]]

Sib. #
1st     Sally
2nd     David
3rd    Daniel
4th     Peter
Name: name, dtype: object

In [12]:
df[df.columns[-1]] # last column in the list

Sib. #
1st       C++
2nd    Python
3rd      Java
4th     Swift
Name: SWskills, dtype: object

## Slicing

In [13]:
df

          name school  height  English  Math  Science SWskills
Sib. #
1st      Sally  Biola     157       97    89       88      C++
2nd      David    UCI     173       78   100       98   Python
3rd     Daniel   Navy     175       95    78       94     Java
4th      Peter  Emery     130      100    97       97    Swift

In [14]:
df['English'][0:2] # bring data from 0~2

Sib. #
1st    97
2nd    78
Name: English, dtype: int64

In [15]:
df[['name', 'height']][:3] # bring first 3's name and height

          name  height
Sib. #
1st      Sally     157
2nd      David     173
3rd     Daniel     175

In [16]:
df[3:] # data from 3and up

         name school  height  English  Math  Science SWskills
Sib. #
4th     Peter  Emery     130      100    97       97    Swift